{"name": "Squabbler", "permalink": "squabbler", "crunchbase_url": "http://www.crunchbase.com/company/squabbler", "homepage_url": "http://www.squabbler.com", "blog_url": "", "blog_feed_url": "", "twitter_username": "squabbler", "category_code": "web", "number_of_employees": null, "founded_year": 2011, "founded_month": 6, "founded_day": 1, "deadpooled_year": null, "deadpooled_month": null, "deadpooled_day": null, "deadpooled_url": null, "tag_list": "video, comparison, debate, squabble, saas, television", "alias_list": null, "email_address": "admin@squabbler.com", "phone_number": "310.876.8020", "description": "Video Comparison Platform", "created_at": "Sat Feb 11 00:42:41 UTC 2012", "updated_at": "Thu Feb 23 09:32:55 UTC 2012", "overview": "\u003Cp\u003ESquabbler is a SaaS video-comparison platform that lets publishers embed customized comparison modules into their website, Facebook page and/or mobile application to increase engagement with their users and their content.  \u003C/p\u003E\n\n\u003Cp\u003EEmbedded below editorial content or products, or serving as the featured editorial content, the comparison module is made up of a left-side video player versus a right-side video player and it is into these players that end-users and/or web publishers upload 30-second videos via mobile device, webcam or hard drive. The online audience then votes for video A or B and can engage in the module through sharing, liking, tweeting, responding to surveys, uploading their own video, and earning status/points/rewards for participation.\u003C/p\u003E\n\n\u003Cp\u003EUse cases include: content comparison, product comparison, product reviews, focus grouping, user generated debate, gated educational debate, political comparison, sports brackets, and integrating full debate functionality into a web property.  For consumers, it\u0026#8217;s an entertaining and new way to engage in web content.  For publishers, it’s an opportunity to monetize existing video libraries and it\u0026#8217;s a wealth of user data and demographic information that will help them make more intelligent publishing and advertising decisions. \u003C/p\u003E\n\n\u003Cp\u003ESquabbler revenue comes from platform licensing and professional services.   As the Squabbler module extends out to more and more publishers of all sizes in all verticals, Squabbler becomes the central repository for video comparison.  This repository feeds a central Squabbler destination site (which features debates/comparisons from our network), a reality television property (currently under development with Sony) and is available to third party publishers wishing to add contextual video comparison to their own editorial content.  Through this video syndication network, Squabbler customers are able to monetize their content across the web.\u003C/p\u003E\n\n\u003Cp\u003ESquabbler is founded by Mike Bender (founder of AwkwardFamilyPhotos.com) and Matt Bijur (early employee at KickApps) and Pete Clark, formerly Co-Founder/Senior Software Engineer and original architect at KickApps.  Squabbler has already worked with The Discovery Channel and Virgin America and is in the process of finalizing initiatives with MTV, Bravo, Advanced Digital and others.  \u003C/p\u003E", "image":  {"available_sizes":    [[[150,       111],      "assets/images/resized/0017/4107/174107v2-max-150x150.jpg"],     [[250,       185],      "assets/images/resized/0017/4107/174107v2-max-250x250.jpg"],     [[320,       237],      "assets/images/resized/0017/4107/174107v2-max-450x450.jpg"]],   "attribution": null}, "products":  [], "relationships":  [], "competitions":  [], "providerships":  [], "total_money_raised": "$0", "funding_rounds":  [], "investments":  [], "acquisition": null, "acquisitions":  [], "offices":  [{"description": "Headquarters",    "address1": "",    "address2": "",    "zip_code": "",    "city": "Santa Monica",    "state_code": "CA",    "country_code": "USA",    "latitude": null,    "longitude": null}], "milestones":  [], "ipo": null, "video_embeds":  [], "screenshots":  [], "external_links":  []}